{
  "meta": {
    "theme": "elegant"
  },
  "basics": {
    "name": "Alexey Ivanov",
    "label": "Front-End / Software / React / Developer",
    "image": "https://avatars.githubusercontent.com/u/25826551?v=4",
    "email": "alexey.ivanov.js@gmail.com",
    "summary": "Frontend / Software Developer with 5+ Years of Experience. Proven track record of optimizing cloud resource utilization for startups, serving clients like Airbnb, Facebook, and leading cloud archiving firms. Expertise in creating dynamic, user-friendly frontend applications using React and TypeScript, harmonizing UI/UX design with robust, scalable code. Excels at driving rapid, appealing application development while maintaining clear communication and a progressive mindset towards new technologies. Passionate about delivering efficient, high-performance cloud solutions that drive business success.",
    "location": {
      "city": "Vancouver",
      "region": "BC",
      "countryCode": "Canada"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "alexey-ivanov-mapledev",
        "url": "https://www.linkedin.com/in/alexey-ivanov-mapledev/"
      },
      {
        "network": "github",
        "username": "mapleDevJS",
        "url": "https://github.com/mapleDevJS"
      }
    ]
  },
  "skills": [
    {
      "name": "Frontend",
      "level": "Intermediate / Senior",
      "keywords": [
        "HTML / JSX",
        "SCSS / CSS / BEM ",
        "Javascript / Typescript",
        "React.js / Next.js",
        "Redux"
      ]
    },
    {
      "name": "Backend",
      "level": "Beginner",
      "keywords": [
        "Node.js / Nest.js",
        "PHP",
        "Postgres",
        "MongoDb"
      ]
    }
  ],
  "work": [
    {
      "name": "Self Employed",
      "location": "Kelowna, BC",
      "description": "As a self-employed software developer, I specialize in crafting e-commerce solutions tailored specifically for online food sales.",
      "position": "Software Developer",
      "url": "https://www.linkedin.com/in/alexey-ivanov-mapledev/",
      "startDate": "2023-09-12",
      "summary": "— Led creation of e-commerce platform for online food  retail\n— Optimized performance for fast load times and smooth browsing\n— Integrated third-party services and APIs for effective functionality\n",
      "highlights": [
        "Next / Typescript / HTML / SCSS / Node/ Express / MongoDB"
      ]
    },
    {
      "name": "Global Relay",
      "location": "Kelowna, BC",
      "description": "Global Relay is a leading provider of cloud-based messaging, archiving, and compliance solutions for the financial services.",
      "position": "Intermediate II React Developer",
      "url": "https://www.globalrelay.com/",
      "startDate": "2022-06-25",
      "endDate": "2023-09-12",
      "summary": "— Enhanced maintainability and scalability by implementing a new frontend architecture, reducing system errors by 20%\n— Strengthened security features by developing a new password selection feature, resulting in a 30% decrease in unauthorized access attempts\n— Contributed to reducing technical debt by refactoring legacy system components, resulting in a 25% increase in system performance\n— Updated and improved design documentation to ensure enhanced project clarity and understanding, resulting in a 20% reduction in development time\n— Managed the successful onboarding of 5 CO-OPs through dedicated mentorship and tailored training programs\n",
      "highlights": [
        "React / Typescript / HTML / SCSS / Docker / Kubernetes / Figma / Jest / React - testing - library / Git"
      ]
    },
    {
      "name": "Capgemini Engineering",
      "location": "Toronto, ON",
      "description": "Top-1 global engineering and digital services company",
      "position": "Senior Software Developer",
      "url": "https://www.capgemini.com/ca-en/",
      "startDate": "2021-10-01",
      "endDate": "2022-06-15",
      "summary": "— Contributed to developing a data pipeline monitoring application by creating and improving the API functionality, resulting in a 40% improvement in data processing efficiency\n— Revamped the user interface, resulting in a 40% decrease in user-reported errors, improving overall user experience during interactions with the pipelines\n— Expanded the existing UI by incorporating additional pipeline parameters, leading to a 30% increase in user engagement and interaction with the pipelines\n— Restructured the infrastructure application, transitioning from a class-based approach to functional components\n— Implemented TypeScript and conducted unit testing, resulting in a 30% reduction in bugs and a 20% increase in code coverage for improved code quality and reliability\n",
      "highlights": [
        "React / Typescript / HTML / SCSS / Jest / React - testing - library / Git"
      ]
    },
    {
      "name": "Barsum Cloud Analytics",
      "location": "Remote",
      "description": "A leader in the Russian market, which designs software that helps banks run and save money in managing the­ir cloud systems",
      "position": "Frontend Developer",
      "url": "https://www.linkedin.com/in/alexey-ivanov-mapledev/",
      "startDate": "2019-11-01",
      "endDate": "2021-10-01",
      "summary": "— Optimized cloud resource planning for leading banks, resulting in a 15% reduction in resource consumption costs within 6 months\n— Led the transition from class-based to functional components, enhancing application responsiveness by 30%\n— Expanded the existing User Interface (UI) by incorporating additional pipeline parameters, leading to a 30% increase in user engagement\n",
      "highlights": [
        "React / Typescript / HTML / SCSS / Redux / Git"
      ]
    }
  ],
  "education": [
    {
      "institution": "State University of Management",
      "url": "https://guu.ru/language/en/",
      "area": "Management",
      "studyType": "Masters",
      "startDate": "1999-09-01",
      "endDate": "2004-06-27"
    },
    {
      "institution": "HTML Academy",
      "url": "https://htmlacademy.org/",
      "area": "Software Development",
      "studyType": "Certificate",
      "startDate": "2019-09-01",
      "endDate": "2020-09-01"
    }
  ]
}