{
  "meta": {
    "theme": "elegant"
  },
  "basics": {
    "name": "Alexey Ivanov",
    "label": "Front-End / Software / React / Developer",
    "image": "https://avatars.githubusercontent.com/u/25826551?v=4",
    "email": "alexey.ivanov.js@gmail.com",
    "summary": "A Frontend/Software Developer with over 5 years of experience in enterprise and startup settings; specializing in ReactJS and TypeScript, with a strong skill set toward a number of tech stacks for dynamic and scalable frontends. Known for cloud resource optimization and creative problem- solving for Airbnb, Facebook, and other clients, enhancing system performance, security, and scalability.",
    "location": {
      "city": "Vancouver",
      "region": "BC",
      "countryCode": "Canada"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "alexey-ivanov-mapledev",
        "url": "https://www.linkedin.com/in/alexey-ivanov-mapledev/"
      },
      {
        "network": "github",
        "username": "mapleDevJS",
        "url": "https://github.com/mapleDevJS"
      }
    ]
  },
  "skills": [
    {
      "name": "Frontend",
      "level": "Intermediate / Senior",
      "keywords": [
        "React", "JavaScript", "TypeScript", "Redux", "Next.js", "HTML, CSS/SCSS", "Jest", "React-Testing-Library", "Webpack"
      ]
    },
    {
      "name": "Backend",
      "level": "Beginner",
      "keywords": [
        "Node.js / Express.js",
        "Nest.js",
        "PHP",
        "Postgres",
        "MongoDb"
      ]
    },
    {
      "name": "DevOps",
      "level": "Beginner",
      "keywords": [
        "Git", "npm/yarn", "GitHub/Bitbucket/Gitlab", "Jenkins", "Travis", "Docker", "Kubernetes"
      ]
    }
  ],
  "work": [
    {
      "name": "Self Employed",
      "location": "Kelowna, BC",
      "description": "As a self-employed software developer, I specialize in crafting e-commerce solutions tailored for online food sales, achieving measurable outcomes:",
      "position": "Software Developer",
      "url": "https://www.linkedin.com/in/alexey-ivanov-mapledev/",
      "startDate": "2023-09-12",
      "summary": "— Led development of e-commerce platforms resulting in a 20% increase in online food retail sales",
      "highlights": [
        "Next / Typescript / HTML / SCSS / Node/ Express / MongoDB"
      ]
    },
    {
      "name": "Global Relay",
      "location": "Kelowna, BC",
      "description": "Global Relay is a leading provider of cloud-based messaging, archiving, and compliance solutions for the financial services industry, committed to implementing best practices and fostering a collaborative, clean environment to ensure optimal performance and security.",
      "position": "Intermediate II React Developer",
      "url": "https://www.globalrelay.com/",
      "startDate": "2022-06-25",
      "endDate": "2023-09-12",
      "summary": "— Improved the maintainability and scalability of a new frontend architecture, and reduced system errors by 20% through collaborative\nteamwork and optimization that included rigorous code review and unit testing.\n— Empowered users by implementing the functionality that would allow them to choose stronger and more secure passwords, using the best practices of the respective industry with full unit tests.\n— Reduced technical debt by refactoring legacy system components; achieved a 25% increase in system performance due to effective optimization and extensive unit testing.\n— Improved documentation of the design, updated and made the distinctness in the project more transparent and easier to understand, thus giving 20% development time back through the emphasis on best practices with respect to documentation and strict unit testing.\n— Over the past year, he addressed a large number of security and quality issues through collaborative debugging and detailed unit testing.\n— Managed the onboarding of 5 CO-OPs through dedicated mentorship and individualized training programs that promoted teamwork and collaborative learning.",
      "highlights": [
        "React / Typescript / HTML / SCSS / Docker / Kubernetes / Figma / Jest / React - testing - library / Git / Webpack"
      ]
    },
    {
      "name": "Capgemini Engineering",
      "location": "Toronto, ON",
      "description": "Top-1 global engineering and digital services company",
      "position": "Senior Software Developer",
      "url": "https://www.capgemini.com/ca-en/",
      "startDate": "2021-10-01",
      "endDate": "2022-06-15",
      "summary": "— Contributed to developing a data pipeline monitoring application by creating and improving the API functionality, resulting in a 40% improvement in data processing efficiency.\n— Expanded UI with additional pipeline parameters, boosting user engagement by 30%.\n— Restructured application infrastructure to functional components/hooks.\n— Implemented TypeScript and rigorously conducted unit testing, reducing bugs by 30% and increasing code coverage by 20%, ensuring robust code quality and reliability.",
      "highlights": [
        "React / Typescript / HTML / SCSS / Jest / React - testing - library / Git / Webpack"
      ]
    },
    {
      "name": "Barsum Cloud Analytics",
      "location": "Remote",
      "description": "A leader in the Russian market, which designs software that helps banks run and save money in managing the­ir cloud systems",
      "position": "Frontend Developer",
      "url": "https://www.linkedin.com/in/alexey-ivanov-mapledev/",
      "startDate": "2019-11-01",
      "endDate": "2021-10-01",
      "summary": "— Developed applications for the largest banks, optimized cloud resource consumption by 25%, reducing operational costs.\n— Designed and developed user interfaces, increasing user satisfaction by 30% with the integration of seamless backends for data retrieval and presentation.\n— Implemented business logic to calculate total resource consumption, thus enabled the performance of effective mass user operations, thereby reducing processing time by 20%.",
      "highlights": [
        "React / Typescript / HTML / SCSS / Redux / Git / Webpack"
      ]
    }
  ],
  "education": [
    {
      "institution": "State University of Management",
      "url": "https://guu.ru/language/en/",
      "area": "Management",
      "studyType": "Masters",
      "startDate": "1999-09-01",
      "endDate": "2004-06-27"
    },
    {
      "institution": "HTML Academy",
      "url": "https://htmlacademy.org/",
      "area": "Software Development",
      "studyType": "Certificate",
      "startDate": "2019-09-01",
      "endDate": "2020-09-01"
    }
  ]
}
