{
  "meta": {
    "theme": "elegant"
  },
  "basics": {
    "name": "Alexey Ivanov",
    "label": "Front-End / Software / React / Developer",
    "image": "https://avatars.githubusercontent.com/u/25826551?v=4",
    "summary": "As an accomplished Front-End Developer, I excel in creating robust and dynamic front-end applications using React and TypeScript. Specializing in web development, I excel in creating user-friendly interfaces, optimizing speed, and ensuring scalability for projects. My collaborative approach in agile environments consistently enables me to meet project targets and deadlines while merging UI/UX design principles seamlessly with functional code to deliver visually appealing applications.\n\nMy core competencies encompass React, JavaScript, TypeScript, HTML, and CSS. Recognized for my proficiency in problem-solving, adaptability, meticulous attention to detail, and collaborative nature, I excel in both in remote and distributed team settings, ensuring effective communication and collaboration.\n\nCommencing as a junior developer, I began a journey of continuous learning and mastering foundational technologies such as React, JavaScript, and TypeScript. Through hands-on experience, mentorship, and a commitment to staying abreast of industry trends, I progressed to become an intermediate/senior developer, equipped with the expertise, confidence, and leadership skills to tackle complex technical challenges and mentor others.\n\nMy commitment to continuous learning is demonstrated by my enrollment in numerous courses and certifications, including those focused on Node.js, React, GraphQL, and software architecture. This commitment is further underscored by my high rankings in JavaScript, React, front-end development, HTML, and CSS assessments on LinkedIn Skill Assessments.\n\nPassionate about leveraging technology to create impactful solutions, I am always eager to embrace new challenges and adopt emerging technologies. I am actively seeking opportunities to drive innovation in collaborative projects and collaborate with forward-thinking teams.\n\nOpen to new opportunities! Let's collaborate on exciting projects. Reach out if you're interested in working together.",
    "email": "alexey.ivanov.js@gmail.com",
    "location": {
      "city": "Vancouver",
      "state": "BC",
      "country": "Canada"
    },
    "profiles": [
      {
        "url": "https://github.com/mapleDevJS",
        "username": "mapleDevJS",
        "network": "github"
      }
    ]
  },
  "education": [
    {
      "endDate": "1999-09-01",
      "startDate": "2004-06-27",
      "area": "Management",
      "studyType": "Masters",
      "institution": "State University of Management"
    },
    {
      "endDate": "2019-09-01",
      "startDate": "2020-09-01",
      "area": "Software Development",
      "studyType": "Certificate",
      "institution": "HTML Academy"
    }
  ],
  "skills": [
    {
      "keywords": [
        "HTML / JSX",
        "SCSS / CSS / BEM ",
        "Javascript / Typescript",
        "React.js / Next.js",
        "Redux"
      ],
      "level": "Intermediate / Senior",
      "name": "Frontend"
    },
    {
      "keywords": [
        "Node",
        "PHP",
        "Postgres",
        "MongoDb"
      ],
      "level": "Beginner",
      "name": "Backend"
    }
  ],
  "work": [
    {
      "summary": "• The new frontend architecture boosted user experience with 20% fewer system errors and enhanced security features. It also advanced business objectives by improving system longevity, increasing performance by 25%, and reducing development time by 20%\n• Strengthened security features by developing a new password selection feature, resulting in a 30% decrease in unauthorized access attempts\n• Empowered users by introducing a feature enabling the selection of stronger and more secure passwords.\n• Contributed to reducing technical debt by refactoring legacy system components, resulting in a 25% increase in system performance\n• Updated and improved design documentation to ensure enhanced project clarity and understanding, resulting in a 20% reduction in development time\n• Addressed a substantial number of security and quality (SQ) issues throughout the past year\n• Managed the successful onboarding of 5 co-op students through dedicated mentorship and tailored training programs",
      "website": "https://www.globalrelay.com/",
      "name": "Global Relay",
      "location": "Kelowna, BC",
      "position": "Intermediate II React Developer",
      "startDate": "2022-06-25",
      "highlights": [
        "React",
        "Typescript",
        "SCSS"
      ]
    }
  ],
  "interests": [
    {
      "name": "Soccer",
      "keywords": []
    },
    {
      "name": "Ice Hockey",
      "keywords": []
    },
    {
      "name": "Formula 1",
      "keywords": []
    },
    {
      "name": "Chess",
      "keywords": []
    }
  ]
}