{
  "meta": {
    "theme": "elegant"
  },
  "basics": {
    "name": "Alexey Ivanov",
    "label": "Front-End / Software / React / Developer",
    "image": "https://avatars.githubusercontent.com/u/25826551?v=4",
    "email": "alexey.ivanov.js@gmail.com",
    "summary": "As an accomplished Front-End Developer, I excel in creating robust and dynamic front-end applications using React and TypeScript. Specializing in web development, I excel in creating user-friendly interfaces, optimizing speed, and ensuring scalability for projects. My collaborative approach in agile environments consistently enables me to meet project targets and deadlines while merging UI/UX design principles seamlessly with functional code to deliver visually appealing applications.\n\nMy core competencies encompass React, JavaScript, TypeScript, HTML, and CSS. Recognized for my proficiency in problem-solving, adaptability, meticulous attention to detail, and collaborative nature, I excel in both remote and distributed team settings, ensuring effective communication and collaboration.\n\nBeginning as a junior developer, I embarked on a journey of continuous learning and mastering foundational technologies such as React, JavaScript, and TypeScript. Through hands-on experience, mentorship, and a commitment to staying abreast of industry trends, I progressed to become an intermediate/senior developer, equipped with the expertise, confidence, and leadership skills to tackle complex technical challenges and mentor others.\n\nMy commitment to continuous learning is demonstrated by my enrollment in numerous courses and certifications, including those focused on Node.js, React, GraphQL, and software architecture. This commitment is further underscored by my high rankings in JavaScript, React, front-end development, HTML, and CSS assessments on LinkedIn Skill Assessments.\n\nPassionate about leveraging technology to create impactful solutions, I am always eager to embrace new challenges and adopt emerging technologies. I am actively seeking opportunities to drive innovation in collaborative projects and collaborate with forward-thinking teams.\n\nI am open to new opportunities and would love to collaborate on exciting projects. Please reach out if you're interested in working together.",
    "location": {
      "city": "Vancouver",
      "region": "BC",
      "countryCode": "Canada"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "alexey-ivanov-mapledev",
        "url": "https://www.linkedin.com/in/alexey-ivanov-mapledev/"
      },
      {
        "network": "github",
        "username": "mapleDevJS",
        "url": "https://github.com/mapleDevJS"
      }
    ]
  },
  "skills": [
    {
      "name": "Frontend",
      "level": "Intermediate / Senior",
      "keywords": [
        "HTML / JSX",
        "SCSS / CSS / BEM ",
        "Javascript / Typescript",
        "React.js / Next.js",
        "Redux"
      ]
    },
    {
      "name": "Backend",
      "level": "Beginner",
      "keywords": [
        "Node.js / Nest.js",
        "PHP",
        "Postgres",
        "MongoDb"
      ]
    }
  ],
  "work": [
    {
      "name": "Global Relay",
      "location": "Kelowna, BC",
      "description": "Global Relay is a self-made, profitable technology company that has grown from 4 to over 1,600 employees and 20,000 customers without taking outside investment, building its own high-quality, innovative solutions while promoting an inspiring work culture and demonstrating leadership in environmental and social responsibility.",
      "position": "Intermediate II React Developer",
      "url": "https://www.globalrelay.com/",
      "startDate": "2022-06-25",
      "summary": "My key achievements include developing an enhanced frontend architecture, increasing security by introducing new password selection features, reducing technical debt, improving design documentation, and successfully onboarding new co-op students. These contributions have significantly improved system performance, user experience and reduced unauthorized access attempts and development time.",
      "highlights": [
        "Enhanced user experience & performance: The implementation of a new frontend architecture not only decreased system errors by 20%, but also improved the longevity, increased overall system performance by 25%, and reduced development time by 20%.",
        "Bolstered Security: Development of an advanced password selection feature resulted in strengthening security and reducing unauthorized access attempts by 30%.",
        "Reduced Technical Debt: Focused efforts on refactoring legacy system components led to a significant 25% rise in system performance",
        "Efficient Project Understanding: By improving design documentation, project clarity was enhanced, leading to a 20% cut in development time.",
        "Team Development: Successfully mentored and onboarded 5 co-op students, contributing to team growth and capacity building.",
        "React / Typescript / HTML / SCSS / Docker / Kubernetes"
      ]
    }
  ],
  "education": [
    {
      "institution": "State University of Management",
      "url": "https://guu.ru/language/en/",
      "area": "Management",
      "studyType": "Masters",
      "startDate": "1999-09-01",
      "endDate": "2004-06-27"
    },
    {
      "institution": "HTML Academy",
      "url": "https://htmlacademy.org/",
      "area": "Software Development",
      "studyType": "Certificate",
      "startDate": "2019-09-01",
      "endDate": "2020-09-01"
    }
  ],
  "interests": [
    {
      "name": "Soccer",
      "keywords": ["Spartak Moscow", "Toronto FC"]
    },
    {
      "name": "Ice Hockey",
      "keywords": ["Toronto Maple Leafs / Spartak Moscow / Lugano HCL"]
    },
    {
      "name": "Formula 1",
      "keywords": ["Ayrton Senna / Kimi Raikkonen / Charles LeClerc"]
    },
    {
      "name": "Chess",
      "keywords": ["Ian Nepomniachtchi"]
    }
  ]
}